data/collected_data/orange/api/standardb12ms/c/load_compose.txt
Running 30m test @ http://20.108.19.154:60/wrk2-api/post/compose
  2 threads and 1000 connections
  Thread calibration: mean lat.: 729.879ms, rate sampling interval: 3747ms
  Thread calibration: mean lat.: 694.327ms, rate sampling interval: 3674ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     8.02m     4.75m   16.93m    58.62%
    Req/Sec   224.91     19.25   264.00     72.35%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.85m 
 75.000%   12.05m 
 90.000%   14.67m 
 99.000%   16.93m 
 99.900%   17.91m 
 99.990%   18.56m 
 99.999%   19.26m 
100.000%   19.35m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      18.575     0.000000            1         1.00
   97320.959     0.100000        80680         1.11
  190578.687     0.200000       161391         1.25
  283639.807     0.300000       242119         1.43
  375652.351     0.400000       322734         1.67
  470810.623     0.500000       403526         2.00
  518258.687     0.550000       443880         2.22
  567803.903     0.600000       484081         2.50
  618659.839     0.650000       524556         2.86
  670040.063     0.700000       564991         3.33
  722993.151     0.750000       605257         4.00
  748158.975     0.775000       625132         4.44
  774373.375     0.800000       645657         5.00
  800587.775     0.825000       665577         5.71
  827326.463     0.850000       685899         6.67
  853540.863     0.875000       705913         8.00
  867172.351     0.887500       716207         8.89
  880279.551     0.900000       726266        10.00
  894435.327     0.912500       736147        11.43
  908591.103     0.925000       746259        13.33
  923271.167     0.937500       756225        16.00
  931135.487     0.943750       761265        17.78
  939524.095     0.950000       766438        20.00
  947388.415     0.956250       771363        22.86
  956301.311     0.962500       776431        26.67
  966787.071     0.968750       781505        32.00
  972029.951     0.971875       784011        35.56
  977797.119     0.975000       786503        40.00
  984612.863     0.978125       789130        45.71
  990904.319     0.981250       791659        53.33
  998244.351     0.984375       794104        64.00
 1002962.943     0.985938       795391        71.11
 1007681.535     0.987500       796627        80.00
 1012400.127     0.989062       797846        91.43
 1017118.719     0.990625       799073       106.67
 1023410.175     0.992188       800377       128.00
 1026555.903     0.992969       800982       142.22
 1029701.631     0.993750       801590       160.00
 1033895.935     0.994531       802217       182.86
 1038090.239     0.995313       802865       213.33
 1043333.119     0.996094       803478       256.00
 1045954.559     0.996484       803809       284.44
 1049100.287     0.996875       804125       320.00
 1052770.303     0.997266       804447       365.71
 1055916.031     0.997656       804735       426.67
 1060634.623     0.998047       805067       512.00
 1063256.063     0.998242       805226       568.89
 1065877.503     0.998437       805382       640.00
 1068498.943     0.998633       805549       731.43
 1071120.383     0.998828       805689       853.33
 1075838.975     0.999023       805854      1024.00
 1077936.127     0.999121       805929      1137.78
 1080033.279     0.999219       806006      1280.00
 1083179.007     0.999316       806096      1462.86
 1086324.735     0.999414       806165      1706.67
 1088421.887     0.999512       806233      2048.00
 1090519.039     0.999561       806276      2275.56
 1092616.191     0.999609       806306      2560.00
 1095761.919     0.999658       806358      2925.71
 1097859.071     0.999707       806410      3413.33
 1099956.223     0.999756       806433      4096.00
 1102053.375     0.999780       806449      4551.11
 1104150.527     0.999805       806471      5120.00
 1105199.103     0.999829       806495      5851.43
 1106247.679     0.999854       806514      6826.67
 1108344.831     0.999878       806523      8192.00
 1112539.135     0.999890       806536      9102.22
 1113587.711     0.999902       806545     10240.00
 1115684.863     0.999915       806554     11702.86
 1118830.591     0.999927       806562     13653.33
 1119879.167     0.999939       806575     16384.00
 1120927.743     0.999945       806579     18204.44
 1132462.079     0.999951       806582     20480.00
 1138753.535     0.999957       806587     23405.71
 1141899.263     0.999963       806594     27306.67
 1146093.567     0.999969       806597     32768.00
 1148190.719     0.999973       806599     36408.89
 1152385.023     0.999976       806604     40960.00
 1152385.023     0.999979       806604     46811.43
 1153433.599     0.999982       806609     54613.33
 1153433.599     0.999985       806609     65536.00
 1154482.175     0.999986       806610     72817.78
 1155530.751     0.999988       806615     81920.00
 1155530.751     0.999989       806615     93622.86
 1155530.751     0.999991       806615    109226.67
 1155530.751     0.999992       806615    131072.00
 1156579.327     0.999993       806617    145635.56
 1156579.327     0.999994       806617    163840.00
 1156579.327     0.999995       806617    187245.71
 1157627.903     0.999995       806619    218453.33
 1157627.903     0.999996       806619    262144.00
 1157627.903     0.999997       806619    291271.11
 1157627.903     0.999997       806619    327680.00
 1157627.903     0.999997       806619    374491.43
 1159725.055     0.999998       806620    436906.67
 1159725.055     0.999998       806620    524288.00
 1159725.055     0.999998       806620    582542.22
 1159725.055     0.999998       806620    655360.00
 1159725.055     0.999999       806620    748982.86
 1160773.631     0.999999       806621    873813.33
 1160773.631     1.000000       806621          inf
#[Mean    =   481494.249, StdDeviation   =   284745.081]
#[Max     =  1159725.056, Total count    =       806621]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  811336 requests in 30.00m, 170.27MB read
  Socket errors: connect 0, read 647, write 16027, timeout 132024
  Non-2xx or 3xx responses: 125203
Requests/sec:    450.74
Transfer/sec:     96.86KB